app/controllers/login_controller.rb

  def create_account
    # Parse request
    data = JSON.parse request.body.read, symbolize_names: true
    username = data[:username]
    email = data[:emai]
    password = data[:password]
    password_confirmation = data[:password_confirmation]

    # Create the new user
    new_user = User.new username: username, email: email
    new_user.password = password
    new_user.password_confirmation = password_confirmation

    # Save the user to the database
    unless new_user.save
---
INSERT INTO `users` (`username`, `password`, `created_at`, `updated_at`, `email`) VALUES ('lukecrum', '1234', '2018-02-11 19:24:25', '2018-02-11 19:24:25', 'lukecrum20@gmail.com')