app/controllers/login_controller.rb

  def find_user_by(login)
    user = User.find_by(username: login)
    user ||= User.find_by(email: login)
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'boone@king.net' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'lukecrum20@gmail.com' LIMIT 1

  def create
    # Create the new user
    new_user = User.new username: @data[:username],
                        email: @data[:email],
                        password: @data[:password],
                        password_confirmation: @data[:password_confirmation]

    # Save the user to the database
    unless new_user.save
---
INSERT INTO `users` (`username`, `password_digest`, `created_at`, `updated_at`, `email`) VALUES ('daecon', '$2a$04$81eMvqd5gyaNAOY0TScDC.bvOUbvoqp53V6S75kHCfR.c9PEGaay.', '2018-02-16 00:45:21', '2018-02-16 00:45:21', 'daecon@quitzonjacobs.info')

  def delete
    user = find_user_by @data[:login]
    return unless user && user_auth?(user, @data[:password])
    unless user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 249